web_p/app/Models/PositionModel.php

SELECT *
FROM "position"
---
    public function getAll()
    {
        $query = $this->db->table('position')
            ->select('*');

        return $query->get()->getResult();