web_p/app/Models/RoomModel.php

    public function searchFreeRoom($type, $min_price, $max_price, $num_of_beds, $booking_from, $booking_to)
    {
        $query = $this->db->table('room')
            ->select('room.*, type.t_name')
            ->join('type', 'room.type_id = type.id');
---
SELECT "room".*, "type"."t_name", "settlement"."is_settled", "settlement"."settlement_date", "settlement"."eviction_date", "settlement"."id" as "settlement_id"
FROM "room"
JOIN "type" ON "room"."type_id" = "type"."id"
LEFT JOIN "settlement" ON "room"."id" = "settlement"."room_id"