web_p/app/Models/ScheduleModel.php

    public function getAll()
    {
        $query = $this->db->table('schedule')
            ->select('*');

        return $query->get()->getResult();
---
SELECT *
FROM "schedule"