web_p/app/Models/ServiceModel.php

    public function search_services($name)
    {
        $query = $this->db->table('service')
            ->select('*');
        if ($name != '') {
            $query->like('name_s', $name);
        }

        return $query->get()->getResult();
---
SELECT *
FROM "service"