web_p/app/Models/TypeModel.php

SELECT "type".*
FROM "type"
---
    public function getTypes()
    {
        $query = $this->db->table('type')
            ->select('type.*');
        $result = $query->get()->getResult();