web_p/app/Models/UserModel.php

    public function search_worker($first_name, $middle_name, $last_name, $position, $role_id)
    {
        $query = $this->db->table('worker')
            ->select('worker.*, position.name_p, role.name_r, schedule.s_name')
            ->join('position', 'worker.position_id = position.id')
            ->join('role', 'worker.role_id = role.id')
            ->join('schedule', 'worker.schedule_id = schedule.id');

        if ($first_name != null)
            $query->like('worker.first_name', pg_escape_string($first_name));
        if ($middle_name != null)
            $query->like('worker.middle_name', pg_escape_string($middle_name));
        if ($last_name != null)
            $query->like('worker.last_name', pg_escape_string($last_name));
        if ($position != null)
            $query->like('position.p_name', pg_escape_string($position));
        if ($role_id != null)
            $query->where('role.id', pg_escape_string($role_id));

        $result = $query->get()->getResult();
---
SELECT "worker".*, "position"."name_p", "role"."name_r", "schedule"."s_name"
FROM "worker"
JOIN "position" ON "worker"."position_id" = "position"."id"
JOIN "role" ON "worker"."role_id" = "role"."id"
JOIN "schedule" ON "worker"."schedule_id" = "schedule"."id"